# -*- coding: utf-8 -*-
# -------------------------------

# @软件：PyCharm
# @PyCharm：自行填入你的版本号
# @Python：自行填入你的版本号
# @项目：code

# -------------------------------

# @文件：ch03.py
# @时间：2024/12/11 20:37
# @作者：Seaton
# @邮箱：seaton.joeng@gmail.com

# -------------------------------

def test_1_3():
    d1 = {'a': 1, 'b': 3}
    d2 = {'a': 2, 'b': 4, 'c': 6}
    # 使用|合并两个字典，返回一个新字典
    print(d1 | d2)
    # 输出: {'a': 2, 'b': 4, 'c': 6}

    # 使用|=就地更新字典d1
    d1 |= d2
    print(d1)
    # 输出: {'a': 2, 'b': 4, 'c': 6}

if __name__ == '__main__':
    test_1_3()
